controllers/ArticleController.php

SELECT * FROM `articles` WHERE `alias`='prodaga-stroitelnih-smesei-forman'
---
    public function actionIndex()
    {
    	$request = Yii::$app->request;

    	$alias = $request->get('alias');

    	$article = Articles::find()->where(['alias' => $alias])->one();