controllers/OptomController.php

    public function actionIndex()
    {
    	$request = Yii::$app->request;

    	$alias = $request->get('alias');

    	$article = Articles::find()->where(['alias' => $alias])->one();
---
SELECT * FROM `articles` WHERE `alias`='suhie-stroitelnie-smesi-optom'