controllers/SiteController.php

    public function actionOptom()
    {
        $id = 13;

        $article = Articles::find()->where(['id'=>$id])->one();
---
SELECT * FROM `articles` WHERE `id`=13

    public function actionArticles()
    {
        $parent = 1;

        $query = Articles::find()->where(['parent' => $parent]);
        $pagination = new Pagination([
            'defaultPageSize' => 10,
            'totalCount' => $query->count()
        ]);
        $articles = $query->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT COUNT(*) FROM `articles` WHERE `parent`=1
SELECT * FROM `articles` WHERE `parent`=1 LIMIT 10 OFFSET 10